//JOB,1 TIME=(1,1),NOTIFY=&SYSYUID
//STEP1    PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *,SYMBOLS=CNV
  ALTER &SYSUID..EXAMPLES.OLDDS -
 NEWNAME (&SYSUID..EXAMPLES.NEWDS)
