//RENAMEDS JOB 1,JOHNB,TIME=(1,1),NOTIFY=&SYSYUID
//*
//* Rename a dataset
//*
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT   DD SYSOUT=*
//SYSIN      DD *,SYMBOLS=CNVTSYS
  ALTER &SYSUID..EXAMPLES.OLDDS -
 NEWNAME (&SYSUID..EXAMPLES.NEWDS)
